<a href="https://colab.research.google.com/github/robsonbfreitas/TrabalhoFinal/blob/main/TrabalhoFinal.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#Importando bibliotecas
import pandas as pd
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score

In [2]:
df = pd.read_csv('features.csv')
#dftest = pd.read_csv('test.csv')
dftrain = pd.read_csv('train.csv')
df.head()

   Store        Date  Temperature  ...         CPI  Unemployment  IsHoliday
0      1  2010-02-05        42.31  ...  211.096358         8.106      False
1      1  2010-02-12        38.51  ...  211.242170         8.106       True
2      1  2010-02-19        39.93  ...  211.289143         8.106      False
3      1  2010-02-26        46.63  ...  211.319643         8.106      False
4      1  2010-03-05        46.50  ...  211.350143         8.106      False

[5 rows x 12 columns]

In [4]:
df_teste = dftrain.query('Store >= 23')
df_train = dftrain.query('Store < 23')
df_teste.head()

        Store  Dept        Date  Weekly_Sales  IsHoliday
216819     23     1  2010-02-05      32452.79      False
216820     23     1  2010-02-12      50360.71       True
216821     23     1  2010-02-19      28504.70      False
216822     23     1  2010-02-26      23033.73      False
216823     23     1  2010-03-05      29662.30      False

In [5]:
df_teste.shape

(204751, 5)

In [6]:
df_train.shape

(216819, 5)

In [7]:
#frames = [df, dftrain]
df_testeFeature = df_teste.merge(df, on=['Store','Date'], how='left')
df_trainWithFeature = df_train.merge(df, on=['Store','Date'], how='left')

In [11]:
df_XTrain = df_trainWithFeature[['Store','Date','IsHoliday_y', 'Dept', 'Weekly_Sales','MarkDown1','MarkDown2','MarkDown3','MarkDown4','MarkDown5']]
df_XTrain.head()

   Store        Date  IsHoliday_y  ...  MarkDown3  MarkDown4  MarkDown5
0      1  2010-02-05        False  ...        NaN        NaN        NaN
1      1  2010-02-12         True  ...        NaN        NaN        NaN
2      1  2010-02-19        False  ...        NaN        NaN        NaN
3      1  2010-02-26        False  ...        NaN        NaN        NaN
4      1  2010-03-05        False  ...        NaN        NaN        NaN

[5 rows x 10 columns]

In [12]:
 df_XTeste = df_testeFeature[['Store','Date','IsHoliday_y', 'Dept', 'Weekly_Sales','MarkDown1','MarkDown2','MarkDown3','MarkDown4','MarkDown5']]
df_XTeste.head()

   Store        Date  IsHoliday_y  ...  MarkDown3  MarkDown4  MarkDown5
0     23  2010-02-05        False  ...        NaN        NaN        NaN
1     23  2010-02-12         True  ...        NaN        NaN        NaN
2     23  2010-02-19        False  ...        NaN        NaN        NaN
3     23  2010-02-26        False  ...        NaN        NaN        NaN
4     23  2010-03-05        False  ...        NaN        NaN        NaN

[5 rows x 10 columns]

In [13]:
df_XTrain['Date'] = pd.to_datetime(df_XTrain['Date'])
df_XTeste['Date'] = pd.to_datetime(df_XTeste['Date'])

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [14]:
df_XTrain.set_index(['Date'], inplace=True)
df_XTeste.set_index(['Date'], inplace=True)

In [15]:
df_XTrain.head()

            Store  IsHoliday_y  Dept  ...  MarkDown3  MarkDown4  MarkDown5
Date                                  ...
2010-02-05      1        False     1  ...        NaN        NaN        NaN
2010-02-12      1         True     1  ...        NaN        NaN        NaN
2010-02-19      1        False     1  ...        NaN        NaN        NaN
2010-02-26      1        False     1  ...        NaN        NaN        NaN
2010-03-05      1        False     1  ...        NaN        NaN        NaN

[5 rows x 9 columns]

In [16]:
df_XTeste.head()

            Store  IsHoliday_y  Dept  ...  MarkDown3  MarkDown4  MarkDown5
Date                                  ...
2010-02-05     23        False     1  ...        NaN        NaN        NaN
2010-02-12     23         True     1  ...        NaN        NaN        NaN
2010-02-19     23        False     1  ...        NaN        NaN        NaN
2010-02-26     23        False     1  ...        NaN        NaN        NaN
2010-03-05     23        False     1  ...        NaN        NaN        NaN

[5 rows x 9 columns]

In [17]:
df_XTrain.fillna(0, inplace=True)
df_XTeste.fillna(0, inplace=True)

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4327: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  downcast=downcast,

In [19]:
df_XTeste.tail(10000)

            Store  IsHoliday_y  Dept  ...  MarkDown3  MarkDown4  MarkDown5
Date                                  ...
2011-05-27     44        False    96  ...       0.00       0.00       0.00
2011-06-03     44        False    96  ...       0.00       0.00       0.00
2011-06-10     44        False    96  ...       0.00       0.00       0.00
2011-06-17     44        False    96  ...       0.00       0.00       0.00
2011-06-24     44        False    96  ...       0.00       0.00       0.00
...           ...          ...   ...  ...        ...        ...        ...
2012-09-28     45        False    98  ...       1.50    1601.01    3288.25
2012-10-05     45        False    98  ...      18.82    2253.43    2340.01
2012-10-12     45        False    98  ...       7.89     599.32    3990.54
2012-10-19     45        False    98  ...       3.18     437.73    1537.49
2012-10-26     45        False    98  ...     100.00     211.94     858.33

[10000 rows x 9 columns]

In [ ]:
y = df_XTrain[['Weekly_Sales']]
y

            Weekly_Sales
Date
2010-02-05      24924.50
2010-02-12      46039.49
2010-02-19      41595.55
2010-02-26      19403.54
2010-03-05      21827.90
...                  ...
2012-10-05        427.25
2012-10-12        247.46
2012-10-19        390.40
2012-10-26        229.21
2010-09-24         27.15

[216819 rows x 1 columns]

In [20]:
y = df_XTeste[['Weekly_Sales']]
y

            Weekly_Sales
Date
2010-02-05      32452.79
2010-02-12      50360.71
2010-02-19      28504.70
2010-02-26      23033.73
2010-03-05      29662.30
...                  ...
2012-09-28        508.37
2012-10-05        628.10
2012-10-12       1061.02
2012-10-19        760.01
2012-10-26       1076.80

[204751 rows x 1 columns]

In [21]:
y = y.iloc[1:]
#y = y.dropna()
y.head()

            Weekly_Sales
Date
2010-02-12      50360.71
2010-02-19      28504.70
2010-02-26      23033.73
2010-03-05      29662.30
2010-03-12      33445.02

In [ ]:
X = df_XTrain[['Store','Dept','IsHoliday_y','Weekly_Sales','MarkDown1','MarkDown2','MarkDown3','MarkDown4','MarkDown5']].shift(1)
#X = df.shift(1)
X

            Store  Dept IsHoliday_y  ...  MarkDown3  MarkDown4  MarkDown5
Date                                 ...
2010-02-05    NaN   NaN         NaN  ...        NaN        NaN        NaN
2010-02-12    1.0   1.0       False  ...       0.00       0.00       0.00
2010-02-19    1.0   1.0        True  ...       0.00       0.00       0.00
2010-02-26    1.0   1.0       False  ...       0.00       0.00       0.00
2010-03-05    1.0   1.0       False  ...       0.00       0.00       0.00
...           ...   ...         ...  ...        ...        ...        ...
2012-10-05   22.0  98.0       False  ...       1.72    2763.63    2130.39
2012-10-12   22.0  98.0       False  ...       4.25    1447.19    3652.84
2012-10-19   22.0  98.0       False  ...      10.35     485.20    4291.26
2012-10-26   22.0  98.0       False  ...       3.66     459.34    3171.35
2010-09-24   22.0  98.0       False  ...     152.91     536.08     708.93

[216819 rows x 9 columns]

In [22]:
X = df_XTeste[['Store','Dept','IsHoliday_y','Weekly_Sales','MarkDown1','MarkDown2','MarkDown3','MarkDown4','MarkDown5']].shift(1)
X

            Store  Dept IsHoliday_y  ...  MarkDown3  MarkDown4  MarkDown5
Date                                 ...
2010-02-05    NaN   NaN         NaN  ...        NaN        NaN        NaN
2010-02-12   23.0   1.0       False  ...       0.00       0.00       0.00
2010-02-19   23.0   1.0        True  ...       0.00       0.00       0.00
2010-02-26   23.0   1.0       False  ...       0.00       0.00       0.00
2010-03-05   23.0   1.0       False  ...       0.00       0.00       0.00
...           ...   ...         ...  ...        ...        ...        ...
2012-09-28   45.0  98.0       False  ...      63.24    2376.38    8670.40
2012-10-05   45.0  98.0       False  ...       1.50    1601.01    3288.25
2012-10-12   45.0  98.0       False  ...      18.82    2253.43    2340.01
2012-10-19   45.0  98.0       False  ...       7.89     599.32    3990.54
2012-10-26   45.0  98.0       False  ...       3.18     437.73    1537.49

[204751 rows x 9 columns]

In [23]:
X = X.iloc[1:]
#X = X.dropna()
X.head()

            Store  Dept IsHoliday_y  ...  MarkDown3  MarkDown4  MarkDown5
Date                                 ...
2010-02-12   23.0   1.0       False  ...        0.0        0.0        0.0
2010-02-19   23.0   1.0        True  ...        0.0        0.0        0.0
2010-02-26   23.0   1.0       False  ...        0.0        0.0        0.0
2010-03-05   23.0   1.0       False  ...        0.0        0.0        0.0
2010-03-12   23.0   1.0       False  ...        0.0        0.0        0.0

[5 rows x 9 columns]

In [24]:
y.shape, X.shape

((204750, 1), (204750, 9))

In [25]:
X = pd.get_dummies(X)
X.head()

            Store  Dept  ...  IsHoliday_y_False  IsHoliday_y_True
Date                     ...
2010-02-12   23.0   1.0  ...                  1                 0
2010-02-19   23.0   1.0  ...                  0                 1
2010-02-26   23.0   1.0  ...                  1                 0
2010-03-05   23.0   1.0  ...                  1                 0
2010-03-12   23.0   1.0  ...                  1                 0

[5 rows x 10 columns]

In [26]:
X.isna().mean()

Store                0.0
Dept                 0.0
Weekly_Sales         0.0
MarkDown1            0.0
MarkDown2            0.0
MarkDown3            0.0
MarkDown4            0.0
MarkDown5            0.0
IsHoliday_y_False    0.0
IsHoliday_y_True     0.0
dtype: float64

In [27]:
reg = LinearRegression()
reg.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [28]:
X.shape

(204750, 10)

In [29]:
y.shape

(204750, 1)

In [30]:
result = reg.predict(X)

In [31]:
result

array([[31169.18551172],
       [47219.16055192],
       [27456.56631477],
       ...,
       [ 1889.80540698],
       [ 2267.80468028],
       [ 1932.91510534]])

In [32]:
# Utilizando R2 para medir a performance do modelo
r2_score(y, result)

0.8908924042500537